name: "yolov8"
backend: "python"
max_batch_size: 16
input [
  {
    name: "INPUT__0"
    data_type: TYPE_UINT8
    dims: [ -1, -1, 3 ]
  }
]
output [
  {
    name: "OUTPUT__0"
    data_type: TYPE_FP32
    dims: [ -1, 6 ]  # [x1,y1,x2,y2,conf,cls]
  }
]
instance_group [{ kind: KIND_CPU }]
